pvvovan/stm32eth/drivers/hal/src/stm32f4xx_hal_eth_ksz8081.c
        status = HAL_ETH_SetSpeedDuplex(heth);
        if (status != HAL_OK)
        {
            err = ETH_ERROR;
            retval = HAL_ERROR;
            goto init_final_stage;
        }
        else
        {
            retval = HAL_OK;
        }
    }

init_final_stage:
    /* Config MAC and DMA */
    ETH_MACDMAConfig(heth, err);
    heth->State = HAL_ETH_STATE_READY;
    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return retval;
}

/**
  * @brief  De-Initializes the ETH peripheral.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_DeInit(ETH_HandleTypeDef *heth)
{
  /* Set the ETH peripheral state to BUSY */
  heth->State = HAL_ETH_STATE_BUSY;

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
  if(heth->MspDeInitCallback == NULL)
  {
    heth->MspDeInitCallback = HAL_ETH_MspDeInit;
  }
  /* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
  heth->MspDeInitCallback(heth);
#else
  /* De-Init the low level hardware : GPIO, CLOCK, NVIC. */
  HAL_ETH_MspDeInit(heth);
#endif

  /* Set ETH HAL state to Disabled */
  heth->State= HAL_ETH_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(heth);

  /* Return function status */
  return HAL_OK;
}

HAL_StatusTypeDef HAL_ETH_Autonegotiate(ETH_HandleTypeDef *heth)
{
    uint32_t phyreg = 0U;
    uint32_t tickstart = 0U;
    HAL_StatusTypeDef status = HAL_ERROR;

    if (heth == NULL)
    {
        return HAL_ERROR;
    }

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Wait while link bring up */
    do
    {
        status = HAL_ETH_ReadPHYRegister(heth, PHY_BASIC_STATUS, &phyreg);
        if (status != HAL_OK)
        {
            return HAL_ERROR;
        }

        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart ) > ETH_TIMEOUT_LINKED_STATE)
        {
            return HAL_TIMEOUT;
        }
    } while (((phyreg & PHY_LINK_IS_UP) != PHY_LINK_IS_UP));

    status = HAL_ETH_ReadPHYRegister(heth, PHY_BASIC_CONTROL, &phyreg);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Enable end restart Auto-Negotiation */
    phyreg |= (PHY_AUTONEGOTIATION_ENABLE | PHY_RESTART_AUTONEGOTIATION);
    status = HAL_ETH_WritePHYRegister(heth, PHY_BASIC_CONTROL, PHY_AUTONEGOTIATION_ENABLE);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Wait until the auto-negotiation is completed */
    do
    {
        HAL_ETH_ReadPHYRegister(heth, PHY_BASIC_STATUS, &phyreg);

        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart ) > ETH_TIMEOUT_AUTONEGO_COMPLETED)
        {
            return HAL_TIMEOUT;
        }

    } while (((phyreg & PHY_AUTONEG_COMPLETE) != PHY_AUTONEG_COMPLETE));

    /* Read the result of the auto-negotiation */
    if ((HAL_ETH_ReadPHYRegister(heth, PHY_CONTROL1, &phyreg)) != HAL_OK)
    {
        /* In case of write timeout */
        return  HAL_ERROR;
    }

    /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
    if (phyreg & PHY_FULL_DUPLEX)
    {
        /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
        (heth->Init).DuplexMode = ETH_MODE_FULLDUPLEX;
    }
    else
    {
        /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
        (heth->Init).DuplexMode = ETH_MODE_HALFDUPLEX;
    }
    /* Configure the MAC with the speed fixed by the auto-negotiation process */
    if (phyreg & PHY_SPEED_10BASE_T)
    {
        /* Set Ethernet speed to 10M following the auto-negotiation */
        (heth->Init).Speed = ETH_SPEED_10M;
    }
    else
    {
        /* Set Ethernet speed to 100M following the auto-negotiation */
        (heth->Init).Speed = ETH_SPEED_100M;
    }

    return HAL_OK;
}

HAL_StatusTypeDef HAL_ETH_SetSpeedDuplex(ETH_HandleTypeDef *heth)
{
    uint32_t phyreg = 0U;
    HAL_StatusTypeDef status = HAL_ERROR;

    if (heth == NULL)
    {
        return HAL_ERROR;
    }

    status = HAL_ETH_ReadPHYRegister(heth, PHY_BASIC_CONTROL, &phyreg);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

    phyreg &= ~(PHY_SPEED_MASK | PHY_DUPLEX_MASK);
    /* Set MAC Speed and Duplex Mode */
    if (heth->Init.Speed == ETH_SPEED_100M)
    {
        phyreg |= PHY_SPEED_100M;
    }
    else
    {
        phyreg |= PHY_SPEED_10M;
    }

    if (heth->Init.DuplexMode == ETH_MODE_FULLDUPLEX)
    {
        phyreg |= PHY_DUPLEX_FULL;
    }
    else
    {
        phyreg |= PHY_DUPLEX_HALF;
    }

    status = HAL_ETH_WritePHYRegister(heth, PHY_BASIC_CONTROL, phyreg);
    if (status != HAL_OK)
    {
        return HAL_ERROR;
    }

    return HAL_OK;
}

/**
  * @brief  Initializes the DMA Tx descriptors in chain mode.
  * @param  heth pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  DMATxDescTab Pointer to the first Tx desc list
  * @param  TxBuff Pointer to the first TxBuffer list
  * @param  TxBuffCount Number of the used Tx desc in the list
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ETH_DMATxDescListInit(ETH_HandleTypeDef *heth, ETH_DMADescTypeDef *DMATxDescTab, uint8_t *TxBuff, uint32_t TxBuffCount)
{
  uint32_t i = 0U;
  ETH_DMADescTypeDef *dmatxdesc;

  /* Process Locked */
  __HAL_LOCK(heth);

  /* Set the ETH peripheral state to BUSY */
  heth->State = HAL_ETH_STATE_BUSY;

  /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
  heth->TxDesc = DMATxDescTab;

  /* Fill each DMATxDesc descriptor with the right values */
  for(i=0U; i < TxBuffCount; i++)
  {
    /* Get the pointer on the ith member of the Tx Desc list */
    dmatxdesc = DMATxDescTab + i;

    /* Set Second Address Chained bit */
    dmatxdesc->Status = ETH_DMATXDESC_TCH;

